app/controllers/racers_controller.rb

  def index
    @racers = Racer.all
---
SELECT "racers".* FROM "racers"

  def show
    @racer = Racer.find(params[:id])
---
SELECT  "racers".* FROM "racers" WHERE "racers"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]

  def create
    @racer = Racer.new(racer_params)
        # racer.selfie.attach(params[:selfie])
      #  redirect_to @racer

    respond_to do |format|
      if @racer.save
---
INSERT INTO "racers" ("first_name", "last_name", "city", "state", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["first_name", "Dustin"], ["last_name", "Green"], ["city", "Hickory Hills"], ["state", "IL"], ["created_at", "2019-06-26 03:00:12.669215"], ["updated_at", "2019-06-26 03:00:12.669215"]]

  def update
    respond_to do |format|
      if @racer.update(racer_params)
---
UPDATE "racers" SET "updated_at" = ? WHERE "racers"."id" = ?  [["updated_at", "2019-06-26 03:19:12.071900"], ["id", 5]]

  def destroy
    @racer.destroy
---
DELETE FROM "racers" WHERE "racers"."id" = ?  [["id", 1]]

    def set_racer
      @racer = Racer.find(params[:id])
---
SELECT  "racers".* FROM "racers" WHERE "racers"."id" = ? LIMIT ?  [["id", 0], ["LIMIT", 1]]