app/controllers/slogans_controller.rb

  def index
    @slogans = Slogan.all
---
SELECT "slogans".* FROM "slogans"

  def create
    @slogan = Slogan.new(slogan_params)

    respond_to do |format|
      if @slogan.save
---
INSERT INTO "slogans" ("first_name", "last_name", "email", "slogan", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["first_name", "Joe"], ["last_name", "Smith"], ["email", "franksmith@gmail.com"], ["slogan", "test1"], ["created_at", "2019-07-17 03:11:47.828981"], ["updated_at", "2019-07-17 03:11:47.828981"]]

  def destroy
    @slogan.destroy
---
DELETE FROM "slogans" WHERE "slogans"."id" = ?  [["id", 980190962]]

    def set_slogan
      @slogan = Slogan.find(params[:id])
---
SELECT  "slogans".* FROM "slogans" WHERE "slogans"."id" = ? LIMIT ?  [["id", 0], ["LIMIT", 1]]